{
    "1": {
        "pergunta": "Em computação, qual é a definição de pilha? O que significa LIFO?",
        "resposta": {
            "1.1":  "pilha é um amontoado de itens, uns sobre os outros",
            "1.2": "LIFO significa Last In First Out. O ultimo a ser inserido é o primeiro a ser retirado"
        }
    },
    "2": {
        "pergunta": "Qual é a principal regra da pilha? Porque não devemos quebrá-la?",
        "resposta": {
            "2.1": "Não deve ser possível o acesso direto a um determinado item da pilha, como feito em arrays, por exemplo. Acesso sempre feito pelas extremidades",
            "2.2": "Para evitar problemas :("
        }
    },
    "3": {
        "pergunta": "Com os seguintes símbolos: 5, 92, 18, 1, 38. Insira esses elementos na pilha, um por vez.",
        "resposta": [
            [5], [5, 92], [5, 92, 18], [5, 92, 18, 1], [5, 92, 18, 1, 38]
        ]
    },
    "4": {
        "pergunta": "Como faço para remover o elemento com o símbolo 18 da pilha, mantendo os demais na pilha, usando somente a estrutura pilha?",
        "resposta": {
            "1": "desempilhar os elementos acima do 18 e empilhar eles em outra pilha",
            "2": "18 é o novo topo",
            "3": "desempilha o 18",
            "4": "empilha novamente os que estavam acima do 18"
        }
    },
    "5": {
        "pergunta": "Qual é a utilidade da pilha? Cite exemplos.",
        "resposta": "é uma estrutura de dados que garante acesso a apenas um dado, o ultimo inserido",
        "exemplos": [
            "controle de paginas do navegador",
            "git stash"
        ]
    },
    "6": {
        "pergunta": "Quais os principais componentes da pilha? O que é o topo? Qual é a importância do topo da pilha?",
        "respostas": {
            "6.1": [
                "topo ---> ultimo elemento empilhado",
                "fundo ----> primeiro elemento empilhado",
                "apontador para o topo",
                "nós ----> são os itens da pilha"
            ],
            "6.2": "topo é o último elemento que foi empilhado",
            "6.3": "o topo é importante por que é o único elemento em que a pilha tem acesso"
        }
    },
    "7": {
        "pergunta": "Quais as formas mais comuns de implementação de pilha? Mostre como as diferentes implementações se comportam.",
        "respostas": {
            "7.1": {
                "1": "implementação usando encadeamento de nós(elementos)",
                "2": "implementação usando arranjo para armazenamento dos elementos"
            },
            "7.2": {
                "1": "cada nó da pilha possui informações e aponta para o proximo nó. o último nó da pilha aponta para null (termino da pilha)"
            }
        }
    },
    "8": {
        "pergunta": "Em C++, considerando a implementação por encadeamento de nós, o que é necessário fazer na função de criar pilha?",
        "resposta": [
            "topo aponta para null",
            "tamanho = 0"
        ]
    },
    "9": {
        "pergunta": "Em C++, considerando a implementação por encadeamento de nós, o que é necessário fazer na função de inserir na pilha?",
        "resposta": {
            "novo topo": [
                "criar novo nó com o dado",
                "ponteiro do proximo aponta para o antigo topo"
            ],
            "ponteiro do topo": "aponta para o novo nó",
            "topo antigo": [
                "ponteiro do proximo aponta para null"
            ],
            "tamanho": "tamanho++"
        }
    },
    "10": {
        "pergunta": "Em C++, considerando a implementação por encadeamento de nós, o que é necessário fazer na função de remover da pilha?",
        "resposta": {
            "variavel_auxiliar": "aponta para o nó do topo",
            "variavel qualquer": "armazenar o valor da variavel_auxiliar acima",
            "novo topo": "aponta para variavel_auxiliar.proximo",
            "apagar variavel_auxiliar": "delete variavel_auxiliar",
            "tamanho": "tamanho--"
        }
    },
    "11": {
        "pergunta": "Além das três funções básicas, quais outras funções que a pilha pode ter? Quais são as características das funções para justificar a necessidade de implementá-las?",
        "respostas": { 
            "11.1": [
                "retirar todos elementos da pilha, desempilhamento, 1 a 1",
                "verificar numero de elementos da pilha",
                "verificar se a pilha está vazia",
                "acessar topo da pilha",
                "depurar/imprimir pilha"
            ],
            "*11.2": "não se deve quebrar a estrutura e percorrê-la com um for, por exemplo. Isso é uma quebra da estrutura. deve ser usado apenas para fins didaticos"
        }
    }

}