{
    "1": {
        "pergunta": "O que é uma árvore? O que é uma árvore binária? Apresente a definição recursiva de árvore binária.",
        "resposta": {
            "1.1":  "grafo conexo e sem ciclos",
            "grafo conexo": "um grafo é conexo quando existe uma sequência de arestas qualquer que permite ligar um noh em outro",
            "grafo aciclico": "quando saindo de um noh específico, é impossível voltar a ele, sem passar por outro noh",
            "1.2": "cada noh tem 0, 1 ou 2 filhos",
            "1.3": [
                "uma árvore vazia (ponteiro da raiz nulo)",
                "um noh raiz contendo duas subárvores, identificadas como subárvore direita e subarvore esquerda"
            ]
        }
    },
    "2": {
        "pergunta": "O que é o percorrimento de uma árvore? O que é o percorrimento pré-ordem em uma árvore binária? Apresente um exemplo.",
        "resposta": {
            "2.1": "é a ação de percorrer os nohs e fazer determinada ação com os valores. Imprimir, retornar, somar, etc",
            "2.2": "trata (executa ação) a raiz, percore a SE, percorre a SD, repete",
            "exemplo": "ver imagem img/percorrimento.png"
        }
    },
    "3": {
        "pergunta": "O que é o percorrimento em-ordem em uma árvore binária? Apresente um exemplo.",
        "resposta": {
            "3.1": "percore a SE, trata raiz, percorre a SD",
            "exemplo": "ver imagem img/percorrimento.png"
        }
    },
    "4": {
        "pergunta": "O que é o percorrimento pós-ordem em uma árvore binária? Apresente um exemplo.",
        "resposta": {
            "4.1": "percore a SE, percorre a SD, trata raiz",
            "exemplo": "ver imagem img/percorrimento.png"
        }
    },
    "5": {
        "pergunta": "O que é uma árvore binária de busca (ABB)? O que é uma árvore binária de busca balanceada? Explique as vantagens de uma árvore binária de busca estar balanceada",
        "resposta": {
            "5.1": "uma árvore binária que, dado qualquer noh, elementos maiores estão à direita e elementos menores à esquerda. busca semelhante a uma busca binária. uma árvore com altura h pode ter, no máximo, 2^(h+1) - 1 nós ----> O(2^h)",
            "5.2": "balanceada significa nohs folha com no máximo 1 nível de diferença",
            "exemplo": "ver imagem img/percorrimento.png"
        }
    },
    "6": {
        "pergunta": "Mostre como é feita a inserção em uma ABB dos elementos, na sequência, 35, 18, 60, 12, 41, 29, 1, 88.",
        "resposta": {
            "5.1": "ver imagem img/questao_6_arguicao.png"
        }
    },
    "7": {
        "pergunta": "Mostre como é feita a remoção na ABB anterior, dos elementos 88, 12, 35.",
        "resposta": {
            "88": "noh folha, só remover",
            "12": "noh com apenas um filho, filho vai pro lugar do pai, remove pai",
            "35": {
                "problema": "noh com dois filhos",
                "alternativa 1": "trocar pelo antecessor: maior elemento da SE",
                "alternativa 2": "trocar pelo sucessor: menor elemento da SD",
                "resultado": "ver imagem img/antecessor_questao_7_arguicao.png"
            }
        }
    },
    "8": {
        "pergunta": "Mostre como é feita a busca do elemento 1 na ABB anterior.",
        "resposta": {
            "8": [
                "1 == 29 ? false, é menor --> SE",
                "1 == 18 ? false, é menor --> SE",
                "1 == 1 ? true, return noh"
            ]
        }
    }
}